{
  "modul": "cloudflare",
  "name": "load_balancer_pool",
  "url": "https://www.terraform.io/docs/providers/cloudflare/r/load_balancer_pool.html",
  "type": "resource",
  "arguments": [
    {
      "key": "name",
      "description": "- (Required) A short name (tag) for the pool. Only alphanumeric characters, hyphens, and underscores are allowed.",
      "type": "string"
    },
    {
      "key": "origins",
      "description": "- (Required) The list of origins within this pool. Traffic directed at this pool is balanced across all currently healthy origins, provided the pool itself is healthy. It&#39;s a complex value. See description below.",
      "type": "listOf string"
    },
    {
      "key": "check_regions",
      "description": "- (Optional) A list of regions (specified by region code) from which to run health checks. Empty means every Cloudflare data center (the default), but requires an Enterprise plan. Region codes can be found .",
      "type": "nullOr (listOf string)",
      "default": "null"
    },
    {
      "key": "description",
      "description": "- (Optional) Free text description.",
      "type": "nullOr string",
      "default": "null"
    },
    {
      "key": "enabled",
      "description": "- (Optional) Whether to enable (the default) this pool. Disabled pools will not receive traffic and are excluded from health checks. Disabling a pool will cause any load balancers using it to failover to the next pool (if any).",
      "type": "nullOr bool",
      "default": "null"
    },
    {
      "key": "minimum_origins",
      "description": "- (Optional) The minimum number of origins that must be healthy for this pool to serve traffic. If the number of healthy origins falls below this number, the pool will be marked unhealthy and we will failover to the next available pool. Default: 1.",
      "type": "nullOr (either string int)",
      "default": "null"
    },
    {
      "key": "monitor",
      "description": "- (Optional) The ID of the Monitor to use for health checking origins within this pool.",
      "type": "nullOr string",
      "default": "null"
    },
    {
      "key": "notification_email",
      "description": "- (Optional) The email address to send health status notifications to. This can be an individual mailbox or a mailing list.",
      "type": "nullOr string",
      "default": "null"
    }
  ]
}
